hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_tim1.h
// SMCR Configuration

#define	TIM1_SMCR_SMSPS				(0x1u<<25)
#define	TIM1_SMCR_SMSPE				(0x1u<<24)
#define	TIM1_SMCR_TS_1				(0x3u<<20)
#define	TIM1_SMCR_TS_1_0			(0x1u<<20)
#define	TIM1_SMCR_SMS_1				(0x1u<<16)
#define	TIM1_SMCR_ETP				(0x1u<<15)
#define	TIM1_SMCR_ECE				(0x1u<<14)
#define	TIM1_SMCR_ETPS				(0x3u<<12)
#define	TIM1_SMCR_ETPS_0			(0x1u<<12)
#define	TIM1_SMCR_ETF				(0xFu<<8)
#define	TIM1_SMCR_ETF_0				(0x1u<<8)
#define	TIM1_SMCR_MSM				(0x1u<<7)
#define	TIM1_SMCR_TS				(0x7u<<4)
#define	TIM1_SMCR_TS_0				(0x1u<<4)
#define	TIM1_SMCR_SMS				(0x7u<<0)
#define	TIM1_SMCR_SMS_0				(0x1u<<0)

#define	TIM1_SMCR_SMSPS_B_0X0		(0x0u<<25)
#define	TIM1_SMCR_SMSPS_B_0X1		(0x1u<<25)
#define	TIM1_SMCR_SMSPE_B_0X0		(0x0u<<24)
#define	TIM1_SMCR_SMSPE_B_0X1		(0x1u<<24)
#define	TIM1_SMCR_ETP_B_0X0			(0x0u<<15)
#define	TIM1_SMCR_ETP_B_0X1			(0x1u<<15)
#define	TIM1_SMCR_ECE_B_0X0			(0x0u<<14)
#define	TIM1_SMCR_ECE_B_0X1			(0x1u<<14)
#define	TIM1_SMCR_ETPS_B_0X0		(0x0u<<12)
#define	TIM1_SMCR_ETPS_B_0X1		(0x1u<<12)
#define	TIM1_SMCR_ETPS_B_0X2		(0x2u<<12)
#define	TIM1_SMCR_ETPS_B_0X3		(0x3u<<12)
#define	TIM1_SMCR_ETF_B_0X0			(0x0u<<8)
#define	TIM1_SMCR_ETF_B_0X1			(0x1u<<8)
#define	TIM1_SMCR_ETF_B_0X2			(0x2u<<8)
#define	TIM1_SMCR_ETF_B_0X3			(0x3u<<8)
#define	TIM1_SMCR_ETF_B_0X4			(0x4u<<8)
#define	TIM1_SMCR_ETF_B_0X5			(0x5u<<8)
#define	TIM1_SMCR_ETF_B_0X6			(0x6u<<8)
#define	TIM1_SMCR_ETF_B_0X7			(0x7u<<8)
#define	TIM1_SMCR_ETF_B_0X8			(0x8u<<8)
#define	TIM1_SMCR_ETF_B_0X9			(0x9u<<8)
#define	TIM1_SMCR_ETF_B_0XA			(0xAu<<8)
#define	TIM1_SMCR_ETF_B_0XB			(0xBu<<8)
#define	TIM1_SMCR_ETF_B_0XC			(0xCu<<8)
#define	TIM1_SMCR_ETF_B_0XD			(0xDu<<8)
#define	TIM1_SMCR_ETF_B_0XE			(0xEu<<8)
#define	TIM1_SMCR_ETF_B_0XF			(0xFu<<8)
#define	TIM1_SMCR_MSM_B_0X0			(0x0u<<7)
#define	TIM1_SMCR_MSM_B_0X1			(0x1u<<7)
#define	TIM1_SMCR_TS_B_0X0			(0x0u<<4)
#define	TIM1_SMCR_TS_B_0X1			(0x1u<<4)
#define	TIM1_SMCR_TS_B_0X2			(0x2u<<4)
#define	TIM1_SMCR_TS_B_0X3			(0x3u<<4)
#define	TIM1_SMCR_TS_B_0X4			(0x4u<<4)
#define	TIM1_SMCR_TS_B_0X5			(0x5u<<4)
#define	TIM1_SMCR_TS_B_0X6			(0x6u<<4)
#define	TIM1_SMCR_TS_B_0X7			(0x7u<<4)
#define	TIM1_SMCR_SMS_B_0X0			(0x0u<<0)
#define	TIM1_SMCR_SMS_B_0X1			(0x1u<<0)
#define	TIM1_SMCR_SMS_B_0X2			(0x2u<<0)
#define	TIM1_SMCR_SMS_B_0X3			(0x3u<<0)
#define	TIM1_SMCR_SMS_B_0X4			(0x4u<<0)
#define	TIM1_SMCR_SMS_B_0X5			(0x5u<<0)
#define	TIM1_SMCR_SMS_B_0X6			(0x6u<<0)
#define	TIM1_SMCR_SMS_B_0X7			(0x7u<<0)

// DIER Configuration

#define	TIM1_DIER_TERRIE			(0x1u<<23)
#define	TIM1_DIER_IERRIE			(0x1u<<22)
#define	TIM1_DIER_DIRIE				(0x1u<<21)
#define	TIM1_DIER_IDXIE				(0x1u<<20)
#define	TIM1_DIER_TDE				(0x1u<<14)
#define	TIM1_DIER_COMDE				(0x1u<<13)
#define	TIM1_DIER_CC4DE				(0x1u<<12)
#define	TIM1_DIER_CC3DE				(0x1u<<11)
#define	TIM1_DIER_CC2DE				(0x1u<<10)
#define	TIM1_DIER_CC1DE				(0x1u<<9)
#define	TIM1_DIER_UDE				(0x1u<<8)
#define	TIM1_DIER_BIE				(0x1u<<7)
#define	TIM1_DIER_TIE				(0x1u<<6)
#define	TIM1_DIER_COMIE				(0x1u<<5)
#define	TIM1_DIER_CC4IE				(0x1u<<4)
#define	TIM1_DIER_CC3IE				(0x1u<<3)
#define	TIM1_DIER_CC2IE				(0x1u<<2)
#define	TIM1_DIER_CC1IE				(0x1u<<1)
#define	TIM1_DIER_UIE				(0x1u<<0)

#define	TIM1_DIER_TERRIE_B_0X0		(0x0u<<23)
#define	TIM1_DIER_TERRIE_B_0X1		(0x1u<<23)
#define	TIM1_DIER_IERRIE_B_0X0		(0x0u<<22)
#define	TIM1_DIER_IERRIE_B_0X1		(0x1u<<22)
#define	TIM1_DIER_DIRIE_B_0X0		(0x0u<<21)
#define	TIM1_DIER_DIRIE_B_0X1		(0x1u<<21)
#define	TIM1_DIER_IDXIE_B_0X0		(0x0u<<20)
#define	TIM1_DIER_IDXIE_B_0X1		(0x1u<<20)
#define	TIM1_DIER_TDE_B_0X0			(0x0u<<14)
#define	TIM1_DIER_TDE_B_0X1			(0x1u<<14)
#define	TIM1_DIER_COMDE_B_0X0		(0x0u<<13)
#define	TIM1_DIER_COMDE_B_0X1		(0x1u<<13)
#define	TIM1_DIER_CC4DE_B_0X0		(0x0u<<12)
#define	TIM1_DIER_CC4DE_B_0X1		(0x1u<<12)
#define	TIM1_DIER_CC3DE_B_0X0		(0x0u<<11)
#define	TIM1_DIER_CC3DE_B_0X1		(0x1u<<11)
#define	TIM1_DIER_CC2DE_B_0X0		(0x0u<<10)
#define	TIM1_DIER_CC2DE_B_0X1		(0x1u<<10)
#define	TIM1_DIER_CC1DE_B_0X0		(0x0u<<9)
#define	TIM1_DIER_CC1DE_B_0X1		(0x1u<<9)
#define	TIM1_DIER_UDE_B_0X0			(0x0u<<8)
#define	TIM1_DIER_UDE_B_0X1			(0x1u<<8)
#define	TIM1_DIER_BIE_B_0X0			(0x0u<<7)
#define	TIM1_DIER_BIE_B_0X1			(0x1u<<7)
#define	TIM1_DIER_TIE_B_0X0			(0x0u<<6)
#define	TIM1_DIER_TIE_B_0X1			(0x1u<<6)
#define	TIM1_DIER_COMIE_B_0X0		(0x0u<<5)
#define	TIM1_DIER_COMIE_B_0X1		(0x1u<<5)
#define	TIM1_DIER_CC4IE_B_0X0		(0x0u<<4)
#define	TIM1_DIER_CC4IE_B_0X1		(0x1u<<4)
#define	TIM1_DIER_CC3IE_B_0X0		(0x0u<<3)
#define	TIM1_DIER_CC3IE_B_0X1		(0x1u<<3)
#define	TIM1_DIER_CC2IE_B_0X0		(0x0u<<2)
#define	TIM1_DIER_CC2IE_B_0X1		(0x1u<<2)
#define	TIM1_DIER_CC1IE_B_0X0		(0x0u<<1)
#define	TIM1_DIER_CC1IE_B_0X1		(0x1u<<1)
#define	TIM1_DIER_UIE_B_0X0			(0x0u<<0)
#define	TIM1_DIER_UIE_B_0X1			(0x1u<<0)

// SR Configuration

#define	TIM1_SR_TERRF				(0x1u<<23)
#define	TIM1_SR_IERRF				(0x1u<<22)
#define	TIM1_SR_DIRF				(0x1u<<21)
#define	TIM1_SR_IDXF				(0x1u<<20)
#define	TIM1_SR_CC6IF				(0x1u<<17)
#define	TIM1_SR_CC5IF				(0x1u<<16)
#define	TIM1_SR_SBIF				(0x1u<<13)
#define	TIM1_SR_CC4OF				(0x1u<<12)
#define	TIM1_SR_CC3OF				(0x1u<<11)
#define	TIM1_SR_CC2OF				(0x1u<<10)
#define	TIM1_SR_CC1OF				(0x1u<<9)
#define	TIM1_SR_B2IF				(0x1u<<8)
#define	TIM1_SR_BIF					(0x1u<<7)
#define	TIM1_SR_TIF					(0x1u<<6)
#define	TIM1_SR_COMIF				(0x1u<<5)
#define	TIM1_SR_CC4IF				(0x1u<<4)
#define	TIM1_SR_CC3IF				(0x1u<<3)
#define	TIM1_SR_CC2IF				(0x1u<<2)
#define	TIM1_SR_CC1IF				(0x1u<<1)
#define	TIM1_SR_UIF					(0x1u<<0)

#define	TIM1_SR_TERRF_B_0X0			(0x0u<<23)
#define	TIM1_SR_TERRF_B_0X1			(0x1u<<23)
#define	TIM1_SR_IERRF_B_0X0			(0x0u<<22)
#define	TIM1_SR_IERRF_B_0X1			(0x1u<<22)
#define	TIM1_SR_DIRF_B_0X0			(0x0u<<21)
#define	TIM1_SR_DIRF_B_0X1			(0x1u<<21)
#define	TIM1_SR_IDXF_B_0X0			(0x0u<<20)
#define	TIM1_SR_IDXF_B_0X1			(0x1u<<20)
#define	TIM1_SR_SBIF_B_0X0			(0x0u<<13)
#define	TIM1_SR_SBIF_B_0X1			(0x1u<<13)
#define	TIM1_SR_CC1OF_B_0X0			(0x0u<<9)
#define	TIM1_SR_CC1OF_B_0X1			(0x1u<<9)
#define	TIM1_SR_B2IF_B_0X0			(0x0u<<8)
#define	TIM1_SR_B2IF_B_0X1			(0x1u<<8)
#define	TIM1_SR_BIF_B_0X0			(0x0u<<7)
#define	TIM1_SR_BIF_B_0X1			(0x1u<<7)
#define	TIM1_SR_TIF_B_0X0			(0x0u<<6)
#define	TIM1_SR_TIF_B_0X1			(0x1u<<6)
#define	TIM1_SR_COMIF_B_0X0			(0x0u<<5)
#define	TIM1_SR_COMIF_B_0X1			(0x1u<<5)
#define	TIM1_SR_CC1IF_B_0X0			(0x0u<<1)
#define	TIM1_SR_CC1IF_B_0X1			(0x1u<<1)
#define	TIM1_SR_UIF_B_0X0			(0x0u<<0)
#define	TIM1_SR_UIF_B_0X1			(0x1u<<0)

// EGR Configuration

#define	TIM1_EGR_B2G				(0x1u<<8)
#define	TIM1_EGR_BG					(0x1u<<7)
#define	TIM1_EGR_TG					(0x1u<<6)
#define	TIM1_EGR_COMG				(0x1u<<5)
#define	TIM1_EGR_CC4G				(0x1u<<4)
#define	TIM1_EGR_CC3G				(0x1u<<3)
#define	TIM1_EGR_CC2G				(0x1u<<2)
#define	TIM1_EGR_CC1G				(0x1u<<1)
#define	TIM1_EGR_UG					(0x1u<<0)

