hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_tim1.h
#define	TIM1_EGR_B2G_B_0X0			(0x0u<<8)
#define	TIM1_EGR_B2G_B_0X1			(0x1u<<8)
#define	TIM1_EGR_BG_B_0X0			(0x0u<<7)
#define	TIM1_EGR_BG_B_0X1			(0x1u<<7)
#define	TIM1_EGR_TG_B_0X0			(0x0u<<6)
#define	TIM1_EGR_TG_B_0X1			(0x1u<<6)
#define	TIM1_EGR_COMG_B_0X0			(0x0u<<5)
#define	TIM1_EGR_COMG_B_0X1			(0x1u<<5)
#define	TIM1_EGR_CC1G_B_0X0			(0x0u<<1)
#define	TIM1_EGR_CC1G_B_0X1			(0x1u<<1)
#define	TIM1_EGR_UG_B_0X0			(0x0u<<0)
#define	TIM1_EGR_UG_B_0X1			(0x1u<<0)

// CCMR1 Configuration

#define	TIM1_CCMR1_IC2F				(0xFu<<12)
#define	TIM1_CCMR1_IC2F_0			(0x1u<<12)
#define	TIM1_CCMR1_IC2PSC			(0x3u<<10)
#define	TIM1_CCMR1_IC2PSC_0			(0x1u<<10)
#define	TIM1_CCMR1_CC2S				(0x3u<<8)
#define	TIM1_CCMR1_CC2S_0			(0x1u<<8)
#define	TIM1_CCMR1_IC1F				(0xFu<<4)
#define	TIM1_CCMR1_IC1F_0			(0x1u<<4)
#define	TIM1_CCMR1_IC1PSC			(0x3u<<2)
#define	TIM1_CCMR1_IC1PSC_0			(0x1u<<2)
#define	TIM1_CCMR1_CC1S				(0x3u<<0)
#define	TIM1_CCMR1_CC1S_0			(0x1u<<0)

#define	TIM1_CCMR1_CC2S_B_0X0		(0x0u<<8)
#define	TIM1_CCMR1_CC2S_B_0X1		(0x1u<<8)
#define	TIM1_CCMR1_CC2S_B_0X2		(0x2u<<8)
#define	TIM1_CCMR1_CC2S_B_0X3		(0x3u<<8)
#define	TIM1_CCMR1_IC1F_B_0X0		(0x0u<<4)
#define	TIM1_CCMR1_IC1F_B_0X1		(0x1u<<4)
#define	TIM1_CCMR1_IC1F_B_0X2		(0x2u<<4)
#define	TIM1_CCMR1_IC1F_B_0X3		(0x3u<<4)
#define	TIM1_CCMR1_IC1F_B_0X4		(0x4u<<4)
#define	TIM1_CCMR1_IC1F_B_0X5		(0x5u<<4)
#define	TIM1_CCMR1_IC1F_B_0X6		(0x6u<<4)
#define	TIM1_CCMR1_IC1F_B_0X7		(0x7u<<4)
#define	TIM1_CCMR1_IC1F_B_0X8		(0x8u<<4)
#define	TIM1_CCMR1_IC1F_B_0X9		(0x9u<<4)
#define	TIM1_CCMR1_IC1F_B_0XA		(0xAu<<4)
#define	TIM1_CCMR1_IC1F_B_0XB		(0xBu<<4)
#define	TIM1_CCMR1_IC1F_B_0XC		(0xCu<<4)
#define	TIM1_CCMR1_IC1F_B_0XD		(0xDu<<4)
#define	TIM1_CCMR1_IC1F_B_0XE		(0xEu<<4)
#define	TIM1_CCMR1_IC1F_B_0XF		(0xFu<<4)
#define	TIM1_CCMR1_IC1PSC_B_0X0		(0x0u<<2)
#define	TIM1_CCMR1_IC1PSC_B_0X1		(0x1u<<2)
#define	TIM1_CCMR1_IC1PSC_B_0X2		(0x2u<<2)
#define	TIM1_CCMR1_IC1PSC_B_0X3		(0x3u<<2)
#define	TIM1_CCMR1_CC1S_B_0X0		(0x0u<<0)
#define	TIM1_CCMR1_CC1S_B_0X1		(0x1u<<0)
#define	TIM1_CCMR1_CC1S_B_0X2		(0x2u<<0)
#define	TIM1_CCMR1_CC1S_B_0X3		(0x3u<<0)

// CCMR2 Configuration

#define	TIM1_CCMR2_IC4F				(0xFu<<12)
#define	TIM1_CCMR2_IC4F_0			(0x1u<<12)
#define	TIM1_CCMR2_IC4PSC			(0x3u<<10)
#define	TIM1_CCMR2_IC4PSC_0			(0x1u<<10)
#define	TIM1_CCMR2_CC4S				(0x3u<<8)
#define	TIM1_CCMR2_CC4S_0			(0x1u<<8)
#define	TIM1_CCMR2_IC3F				(0xFu<<4)
#define	TIM1_CCMR2_IC3F_0			(0x1u<<4)
#define	TIM1_CCMR2_IC3PSC			(0x3u<<2)
#define	TIM1_CCMR2_IC3PSC_0			(0x1u<<2)
#define	TIM1_CCMR2_CC3S				(0x3u<<0)
#define	TIM1_CCMR2_CC3S_0			(0x1u<<0)

#define	TIM1_CCMR2_CC4S_B_0X0		(0x0u<<8)
#define	TIM1_CCMR2_CC4S_B_0X1		(0x1u<<8)
#define	TIM1_CCMR2_CC4S_B_0X2		(0x2u<<8)
#define	TIM1_CCMR2_CC4S_B_0X3		(0x3u<<8)
#define	TIM1_CCMR2_CC3S_B_0X0		(0x0u<<0)
#define	TIM1_CCMR2_CC3S_B_0X1		(0x1u<<0)
#define	TIM1_CCMR2_CC3S_B_0X2		(0x2u<<0)
#define	TIM1_CCMR2_CC3S_B_0X3		(0x3u<<0)

// CCER Configuration

#define	TIM1_CCER_CC6P				(0x1u<<21)
#define	TIM1_CCER_CC6E				(0x1u<<20)
#define	TIM1_CCER_CC5P				(0x1u<<17)
#define	TIM1_CCER_CC5E				(0x1u<<16)
#define	TIM1_CCER_CC4NP				(0x1u<<15)
#define	TIM1_CCER_CC4NE				(0x1u<<14)
#define	TIM1_CCER_CC4P				(0x1u<<13)
#define	TIM1_CCER_CC4E				(0x1u<<12)
#define	TIM1_CCER_CC3NP				(0x1u<<11)
#define	TIM1_CCER_CC3NE				(0x1u<<10)
#define	TIM1_CCER_CC3P				(0x1u<<9)
#define	TIM1_CCER_CC3E				(0x1u<<8)
#define	TIM1_CCER_CC2NP				(0x1u<<7)
#define	TIM1_CCER_CC2NE				(0x1u<<6)
#define	TIM1_CCER_CC2P				(0x1u<<5)
#define	TIM1_CCER_CC2E				(0x1u<<4)
#define	TIM1_CCER_CC1NP				(0x1u<<3)
#define	TIM1_CCER_CC1NE				(0x1u<<2)
#define	TIM1_CCER_CC1P				(0x1u<<1)
#define	TIM1_CCER_CC1E				(0x1u<<0)

#define	TIM1_CCER_CC1NP_B_0X0		(0x0u<<3)
#define	TIM1_CCER_CC1NP_B_0X1		(0x1u<<3)
#define	TIM1_CCER_CC1NE_B_0X0		(0x0u<<2)
#define	TIM1_CCER_CC1NE_B_0X1		(0x1u<<2)
#define	TIM1_CCER_CC1P_B_0X0		(0x0u<<1)
#define	TIM1_CCER_CC1P_B_0X1		(0x1u<<1)
#define	TIM1_CCER_CC1E_B_0X0		(0x0u<<0)
#define	TIM1_CCER_CC1E_B_0X1		(0x1u<<0)

// CNT Configuration

#define	TIM1_CNT_UIFCPY				(0x1u<<31)
#define	TIM1_CNT_CNT				(0xFFFFu<<0)
#define	TIM1_CNT_CNT_0				(0x1u<<0)

// PSC Configuration

#define	TIM1_PSC_PSC				(0xFFFFu<<0)
#define	TIM1_PSC_PSC_0				(0x1u<<0)

// ARR Configuration

#define	TIM1_ARR_ARR				(0xFFFFFu<<0)
#define	TIM1_ARR_ARR_0				(0x1u<<0)

// RCR Configuration

#define	TIM1_RCR_REP				(0xFFFFu<<0)
#define	TIM1_RCR_REP_0				(0x1u<<0)

// CCR1 Configuration

#define	TIM1_CCR1_CCR1				(0xFFFFFu<<0)
#define	TIM1_CCR1_CCR1_0			(0x1u<<0)

// CCR2 Configuration

#define	TIM1_CCR2_CCR2				(0xFFFFFu<<0)
#define	TIM1_CCR2_CCR2_0			(0x1u<<0)

// CCR3 Configuration

#define	TIM1_CCR3_CCR3				(0xFFFFFu<<0)
#define	TIM1_CCR3_CCR3_0			(0x1u<<0)

// CCR4 Configuration

#define	TIM1_CCR4_CCR4				(0xFFFFFu<<0)
#define	TIM1_CCR4_CCR4_0			(0x1u<<0)

// BDTR Configuration

#define	TIM1_BDTR_BK2BID			(0x1u<<29)
#define	TIM1_BDTR_BKBID				(0x1u<<28)
#define	TIM1_BDTR_BK2DSRM			(0x1u<<27)
#define	TIM1_BDTR_BKDSRM			(0x1u<<26)
#define	TIM1_BDTR_BK2P				(0x1u<<25)
#define	TIM1_BDTR_BK2E				(0x1u<<24)
#define	TIM1_BDTR_BK2F				(0xFu<<20)
#define	TIM1_BDTR_BK2F_0			(0x1u<<20)
#define	TIM1_BDTR_BKF				(0xFu<<16)
#define	TIM1_BDTR_BKF_0				(0x1u<<16)
#define	TIM1_BDTR_MOE				(0x1u<<15)
#define	TIM1_BDTR_AOE				(0x1u<<14)
#define	TIM1_BDTR_BKP				(0x1u<<13)
#define	TIM1_BDTR_BKE				(0x1u<<12)
#define	TIM1_BDTR_OSSR				(0x1u<<11)
#define	TIM1_BDTR_OSSI				(0x1u<<10)
#define	TIM1_BDTR_LOCK				(0x3u<<8)
#define	TIM1_BDTR_LOCK_0			(0x1u<<8)
#define	TIM1_BDTR_DTG				(0xFFu<<0)
#define	TIM1_BDTR_DTG_0				(0x1u<<0)

#define	TIM1_BDTR_BKBID_B_0X0		(0x0u<<28)
#define	TIM1_BDTR_BKBID_B_0X1		(0x1u<<28)
#define	TIM1_BDTR_BKDSRM_B_0X0		(0x0u<<26)
#define	TIM1_BDTR_BKDSRM_B_0X1		(0x1u<<26)
#define	TIM1_BDTR_BK2P_B_0X0		(0x0u<<25)
#define	TIM1_BDTR_BK2P_B_0X1		(0x1u<<25)
#define	TIM1_BDTR_BK2E_B_0X0		(0x0u<<24)
#define	TIM1_BDTR_BK2E_B_0X1		(0x1u<<24)
#define	TIM1_BDTR_BK2F_B_0X0		(0x0u<<20)
#define	TIM1_BDTR_BK2F_B_0X1		(0x1u<<20)
#define	TIM1_BDTR_BK2F_B_0X2		(0x2u<<20)
#define	TIM1_BDTR_BK2F_B_0X3		(0x3u<<20)
#define	TIM1_BDTR_BK2F_B_0X4		(0x4u<<20)
#define	TIM1_BDTR_BK2F_B_0X5		(0x5u<<20)
#define	TIM1_BDTR_BK2F_B_0X6		(0x6u<<20)
#define	TIM1_BDTR_BK2F_B_0X7		(0x7u<<20)
#define	TIM1_BDTR_BK2F_B_0X8		(0x8u<<20)
#define	TIM1_BDTR_BK2F_B_0X9		(0x9u<<20)
#define	TIM1_BDTR_BK2F_B_0XA		(0xAu<<20)
#define	TIM1_BDTR_BK2F_B_0XB		(0xBu<<20)
#define	TIM1_BDTR_BK2F_B_0XC		(0xCu<<20)
#define	TIM1_BDTR_BK2F_B_0XD		(0xDu<<20)
#define	TIM1_BDTR_BK2F_B_0XE		(0xEu<<20)
#define	TIM1_BDTR_BK2F_B_0XF		(0xFu<<20)
#define	TIM1_BDTR_BKF_B_0X0			(0x0u<<16)
#define	TIM1_BDTR_BKF_B_0X1			(0x1u<<16)
#define	TIM1_BDTR_BKF_B_0X2			(0x2u<<16)
#define	TIM1_BDTR_BKF_B_0X3			(0x3u<<16)
#define	TIM1_BDTR_BKF_B_0X4			(0x4u<<16)
#define	TIM1_BDTR_BKF_B_0X5			(0x5u<<16)
#define	TIM1_BDTR_BKF_B_0X6			(0x6u<<16)
#define	TIM1_BDTR_BKF_B_0X7			(0x7u<<16)
#define	TIM1_BDTR_BKF_B_0X8			(0x8u<<16)
#define	TIM1_BDTR_BKF_B_0X9			(0x9u<<16)
#define	TIM1_BDTR_BKF_B_0XA			(0xAu<<16)
#define	TIM1_BDTR_BKF_B_0XB			(0xBu<<16)
#define	TIM1_BDTR_BKF_B_0XC			(0xCu<<16)
#define	TIM1_BDTR_BKF_B_0XD			(0xDu<<16)
#define	TIM1_BDTR_BKF_B_0XE			(0xEu<<16)
#define	TIM1_BDTR_BKF_B_0XF			(0xFu<<16)
#define	TIM1_BDTR_MOE_B_0X0			(0x0u<<15)
#define	TIM1_BDTR_MOE_B_0X1			(0x1u<<15)
#define	TIM1_BDTR_AOE_B_0X0			(0x0u<<14)
#define	TIM1_BDTR_AOE_B_0X1			(0x1u<<14)
#define	TIM1_BDTR_BKP_B_0X0			(0x0u<<13)
#define	TIM1_BDTR_BKP_B_0X1			(0x1u<<13)
#define	TIM1_BDTR_BKE_B_0X0			(0x0u<<12)
#define	TIM1_BDTR_BKE_B_0X1			(0x1u<<12)
#define	TIM1_BDTR_OSSR_B_0X0		(0x0u<<11)
#define	TIM1_BDTR_OSSR_B_0X1		(0x1u<<11)
#define	TIM1_BDTR_OSSI_B_0X0		(0x0u<<10)
#define	TIM1_BDTR_OSSI_B_0X1		(0x1u<<10)
#define	TIM1_BDTR_LOCK_B_0X0		(0x0u<<8)
#define	TIM1_BDTR_LOCK_B_0X1		(0x1u<<8)
#define	TIM1_BDTR_LOCK_B_0X2		(0x2u<<8)
#define	TIM1_BDTR_LOCK_B_0X3		(0x3u<<8)

