hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_tim1.h
// CCR5 Configuration

#define	TIM1_CCR5_GC5C3				(0x1u<<31)
#define	TIM1_CCR5_GC5C2				(0x1u<<30)
#define	TIM1_CCR5_GC5C1				(0x1u<<29)
#define	TIM1_CCR5_CCR5				(0xFFFFFu<<0)
#define	TIM1_CCR5_CCR5_0			(0x1u<<0)

#define	TIM1_CCR5_GC5C3_B_0X0		(0x0u<<31)
#define	TIM1_CCR5_GC5C3_B_0X1		(0x1u<<31)
#define	TIM1_CCR5_GC5C2_B_0X0		(0x0u<<30)
#define	TIM1_CCR5_GC5C2_B_0X1		(0x1u<<30)
#define	TIM1_CCR5_GC5C1_B_0X0		(0x0u<<29)
#define	TIM1_CCR5_GC5C1_B_0X1		(0x1u<<29)

// CCR6 Configuration

#define	TIM1_CCR6_CCR6				(0xFFFFFu<<0)
#define	TIM1_CCR6_CCR6_0			(0x1u<<0)

// CCMR3 Configuration

#define	TIM1_CCMR3_OC6M_1			(0x1u<<24)
#define	TIM1_CCMR3_OC5M_1			(0x1u<<16)
#define	TIM1_CCMR3_OC6CE			(0x1u<<15)
#define	TIM1_CCMR3_OC6M				(0x7u<<12)
#define	TIM1_CCMR3_OC6M_0			(0x1u<<12)
#define	TIM1_CCMR3_OC6PE			(0x1u<<11)
#define	TIM1_CCMR3_OC6FE			(0x1u<<10)
#define	TIM1_CCMR3_OC5CE			(0x1u<<7)
#define	TIM1_CCMR3_OC5M				(0x7u<<4)
#define	TIM1_CCMR3_OC5M_0			(0x1u<<4)
#define	TIM1_CCMR3_OC5PE			(0x1u<<3)
#define	TIM1_CCMR3_OC5FE			(0x1u<<2)

// DTR2 Configuration

#define	TIM1_DTR2_DTPE				(0x1u<<17)
#define	TIM1_DTR2_DTAE				(0x1u<<16)
#define	TIM1_DTR2_DTGF				(0xFFu<<0)
#define	TIM1_DTR2_DTGF_0			(0x1u<<0)

#define	TIM1_DTR2_DTPE_B_0X0		(0x0u<<17)
#define	TIM1_DTR2_DTPE_B_0X1		(0x1u<<17)
#define	TIM1_DTR2_DTAE_B_0X0		(0x0u<<16)
#define	TIM1_DTR2_DTAE_B_0X1		(0x1u<<16)

// ECR Configuration

#define	TIM1_ECR_PWPRSC				(0x7u<<24)
#define	TIM1_ECR_PWPRSC_0			(0x1u<<24)
#define	TIM1_ECR_PW					(0xFFu<<16)
#define	TIM1_ECR_PW_0				(0x1u<<16)
#define	TIM1_ECR_IPOS				(0x3u<<6)
#define	TIM1_ECR_IPOS_0				(0x1u<<6)
#define	TIM1_ECR_FIDX				(0x1u<<5)
#define	TIM1_ECR_IBLK				(0x3u<<3)
#define	TIM1_ECR_IBLK_0				(0x1u<<3)
#define	TIM1_ECR_IDIR				(0x3u<<1)
#define	TIM1_ECR_IDIR_0				(0x1u<<1)
#define	TIM1_ECR_IE					(0x1u<<0)

#define	TIM1_ECR_IPOS_B_0X0			(0x0u<<6)
#define	TIM1_ECR_IPOS_B_0X1			(0x1u<<6)
#define	TIM1_ECR_IPOS_B_0X2			(0x2u<<6)
#define	TIM1_ECR_IPOS_B_0X3			(0x3u<<6)
#define	TIM1_ECR_FIDX_B_0X0			(0x0u<<5)
#define	TIM1_ECR_FIDX_B_0X1			(0x1u<<5)
#define	TIM1_ECR_IBLK_B_0X0			(0x0u<<3)
#define	TIM1_ECR_IBLK_B_0X1			(0x1u<<3)
#define	TIM1_ECR_IBLK_B_0X2			(0x2u<<3)
#define	TIM1_ECR_IDIR_B_0X0			(0x0u<<1)
#define	TIM1_ECR_IDIR_B_0X1			(0x1u<<1)
#define	TIM1_ECR_IDIR_B_0X2			(0x2u<<1)
#define	TIM1_ECR_IE_B_0X0			(0x0u<<0)
#define	TIM1_ECR_IE_B_0X1			(0x1u<<0)

// TISEL Configuration

#define	TIM1_TISEL_TI4SEL			(0xFu<<24)
#define	TIM1_TISEL_TI4SEL_0			(0x1u<<24)
#define	TIM1_TISEL_TI3SEL			(0xFu<<16)
#define	TIM1_TISEL_TI3SEL_0			(0x1u<<16)
#define	TIM1_TISEL_TI2SEL			(0xFu<<8)
#define	TIM1_TISEL_TI2SEL_0			(0x1u<<8)
#define	TIM1_TISEL_TI1SEL			(0xFu<<0)
#define	TIM1_TISEL_TI1SEL_0			(0x1u<<0)

#define	TIM1_TISEL_TI4SEL_B_0X0		(0x0u<<24)
#define	TIM1_TISEL_TI4SEL_B_0X1		(0x1u<<24)
#define	TIM1_TISEL_TI4SEL_B_0XF		(0xFu<<24)
#define	TIM1_TISEL_TI3SEL_B_0X0		(0x0u<<16)
#define	TIM1_TISEL_TI3SEL_B_0X1		(0x1u<<16)
#define	TIM1_TISEL_TI3SEL_B_0XF		(0xFu<<16)
#define	TIM1_TISEL_TI2SEL_B_0X0		(0x0u<<8)
#define	TIM1_TISEL_TI2SEL_B_0X1		(0x1u<<8)
#define	TIM1_TISEL_TI2SEL_B_0XF		(0xFu<<8)
#define	TIM1_TISEL_TI1SEL_B_0X0		(0x0u<<0)
#define	TIM1_TISEL_TI1SEL_B_0X1		(0x1u<<0)
#define	TIM1_TISEL_TI1SEL_B_0XF		(0xFu<<0)

// AF1 Configuration

#define	TIM1_AF1_ETRSEL				(0xFu<<14)
#define	TIM1_AF1_ETRSEL_0			(0x1u<<14)
#define	TIM1_AF1_BKCMP4P			(0x1u<<13)
#define	TIM1_AF1_BKCMP3P			(0x1u<<12)
#define	TIM1_AF1_BKCMP2P			(0x1u<<11)
#define	TIM1_AF1_BKCMP1P			(0x1u<<10)
#define	TIM1_AF1_BKINP				(0x1u<<9)
#define	TIM1_AF1_BKCMP8E			(0x1u<<8)
#define	TIM1_AF1_BKCMP7E			(0x1u<<7)
#define	TIM1_AF1_BKCMP6E			(0x1u<<6)
#define	TIM1_AF1_BKCMP5E			(0x1u<<5)
#define	TIM1_AF1_BKCMP4E			(0x1u<<4)
#define	TIM1_AF1_BKCMP3E			(0x1u<<3)
#define	TIM1_AF1_BKCMP2E			(0x1u<<2)
#define	TIM1_AF1_BKCMP1E			(0x1u<<1)
#define	TIM1_AF1_BKINE				(0x1u<<0)

#define	TIM1_AF1_ETRSEL_B_0X0		(0x0u<<14)
#define	TIM1_AF1_ETRSEL_B_0X1		(0x1u<<14)
#define	TIM1_AF1_ETRSEL_B_0XF		(0xFu<<14)
#define	TIM1_AF1_BKCMP4P_B_0X0		(0x0u<<13)
#define	TIM1_AF1_BKCMP4P_B_0X1		(0x1u<<13)
#define	TIM1_AF1_BKCMP3P_B_0X0		(0x0u<<12)
#define	TIM1_AF1_BKCMP3P_B_0X1		(0x1u<<12)
#define	TIM1_AF1_BKCMP2P_B_0X0		(0x0u<<11)
#define	TIM1_AF1_BKCMP2P_B_0X1		(0x1u<<11)
#define	TIM1_AF1_BKCMP1P_B_0X0		(0x0u<<10)
#define	TIM1_AF1_BKCMP1P_B_0X1		(0x1u<<10)
#define	TIM1_AF1_BKINP_B_0X0		(0x0u<<9)
#define	TIM1_AF1_BKINP_B_0X1		(0x1u<<9)
#define	TIM1_AF1_BKCMP8E_B_0X0		(0x0u<<8)
#define	TIM1_AF1_BKCMP8E_B_0X1		(0x1u<<8)
#define	TIM1_AF1_BKCMP7E_B_0X0		(0x0u<<7)
#define	TIM1_AF1_BKCMP7E_B_0X1		(0x1u<<7)
#define	TIM1_AF1_BKCMP6E_B_0X0		(0x0u<<6)
#define	TIM1_AF1_BKCMP6E_B_0X1		(0x1u<<6)
#define	TIM1_AF1_BKCMP5E_B_0X0		(0x0u<<5)
#define	TIM1_AF1_BKCMP5E_B_0X1		(0x1u<<5)
#define	TIM1_AF1_BKCMP4E_B_0X0		(0x0u<<4)
#define	TIM1_AF1_BKCMP4E_B_0X1		(0x1u<<4)
#define	TIM1_AF1_BKCMP3E_B_0X0		(0x0u<<3)
#define	TIM1_AF1_BKCMP3E_B_0X1		(0x1u<<3)
#define	TIM1_AF1_BKCMP2E_B_0X0		(0x0u<<2)
#define	TIM1_AF1_BKCMP2E_B_0X1		(0x1u<<2)
#define	TIM1_AF1_BKCMP1E_B_0X0		(0x0u<<1)
#define	TIM1_AF1_BKCMP1E_B_0X1		(0x1u<<1)
#define	TIM1_AF1_BKINE_B_0X0		(0x0u<<0)
#define	TIM1_AF1_BKINE_B_0X1		(0x1u<<0)

// AF2 Configuration

#define	TIM1_AF2_OCRSEL				(0x7u<<16)
#define	TIM1_AF2_OCRSEL_0			(0x1u<<16)
#define	TIM1_AF2_BK2CMP4P			(0x1u<<13)
#define	TIM1_AF2_BK2CMP3P			(0x1u<<12)
#define	TIM1_AF2_BK2CMP2P			(0x1u<<11)
#define	TIM1_AF2_BK2CMP1P			(0x1u<<10)
#define	TIM1_AF2_BK2INP				(0x1u<<9)
#define	TIM1_AF2_BK2CMP8E			(0x1u<<8)
#define	TIM1_AF2_BK2CMP7E			(0x1u<<7)
#define	TIM1_AF2_BK2CMP6E			(0x1u<<6)
#define	TIM1_AF2_BK2CMP5E			(0x1u<<5)
#define	TIM1_AF2_BK2CMP4E			(0x1u<<4)
#define	TIM1_AF2_BK2CMP3E			(0x1u<<3)
#define	TIM1_AF2_BK2CMP2E			(0x1u<<2)
#define	TIM1_AF2_BK2CMP1E			(0x1u<<1)
#define	TIM1_AF2_BK2INE				(0x1u<<0)

#define	TIM1_AF2_OCRSEL_B_0X0		(0x0u<<16)
#define	TIM1_AF2_OCRSEL_B_0X1		(0x1u<<16)
#define	TIM1_AF2_OCRSEL_B_0X7		(0x7u<<16)
#define	TIM1_AF2_BK2CMP4P_B_0X0		(0x0u<<13)
#define	TIM1_AF2_BK2CMP4P_B_0X1		(0x1u<<13)
#define	TIM1_AF2_BK2CMP3P_B_0X0		(0x0u<<12)
#define	TIM1_AF2_BK2CMP3P_B_0X1		(0x1u<<12)
#define	TIM1_AF2_BK2CMP2P_B_0X0		(0x0u<<11)
#define	TIM1_AF2_BK2CMP2P_B_0X1		(0x1u<<11)
#define	TIM1_AF2_BK2CMP1P_B_0X0		(0x0u<<10)
#define	TIM1_AF2_BK2CMP1P_B_0X1		(0x1u<<10)
#define	TIM1_AF2_BK2INP_B_0X0		(0x0u<<9)
#define	TIM1_AF2_BK2INP_B_0X1		(0x1u<<9)
#define	TIM1_AF2_BK2CMP8E_B_0X0		(0x0u<<8)
#define	TIM1_AF2_BK2CMP8E_B_0X1		(0x1u<<8)
#define	TIM1_AF2_BK2CMP7E_B_0X0		(0x0u<<7)
#define	TIM1_AF2_BK2CMP7E_B_0X1		(0x1u<<7)
#define	TIM1_AF2_BK2CMP6E_B_0X0		(0x0u<<6)
#define	TIM1_AF2_BK2CMP6E_B_0X1		(0x1u<<6)
#define	TIM1_AF2_BK2CMP5E_B_0X0		(0x0u<<5)
#define	TIM1_AF2_BK2CMP5E_B_0X1		(0x1u<<5)
#define	TIM1_AF2_BK2CMP4E_B_0X0		(0x0u<<4)
#define	TIM1_AF2_BK2CMP4E_B_0X1		(0x1u<<4)
#define	TIM1_AF2_BK2CMP3E_B_0X0		(0x0u<<3)
#define	TIM1_AF2_BK2CMP3E_B_0X1		(0x1u<<3)
#define	TIM1_AF2_BK2CMP2E_B_0X0		(0x0u<<2)
#define	TIM1_AF2_BK2CMP2E_B_0X1		(0x1u<<2)
#define	TIM1_AF2_BK2CMP1E_B_0X0		(0x0u<<1)
#define	TIM1_AF2_BK2CMP1E_B_0X1		(0x1u<<1)
#define	TIM1_AF2_BK2INE_B_0X0		(0x0u<<0)
#define	TIM1_AF2_BK2INE_B_0X1		(0x1u<<0)

// DCR Configuration

#define	TIM1_DCR_DBSS				(0xFu<<16)
#define	TIM1_DCR_DBSS_0				(0x1u<<16)
#define	TIM1_DCR_DBL				(0x1Fu<<8)
#define	TIM1_DCR_DBL_0				(0x1u<<8)
#define	TIM1_DCR_DBA				(0x1Fu<<0)
#define	TIM1_DCR_DBA_0				(0x1u<<0)

#define	TIM1_DCR_DBSS_B_0X1			(0x1u<<16)
#define	TIM1_DCR_DBSS_B_0X2			(0x2u<<16)
#define	TIM1_DCR_DBSS_B_0X3			(0x3u<<16)
#define	TIM1_DCR_DBSS_B_0X4			(0x4u<<16)
#define	TIM1_DCR_DBSS_B_0X5			(0x5u<<16)
#define	TIM1_DCR_DBSS_B_0X6			(0x6u<<16)
#define	TIM1_DCR_DBSS_B_0X7			(0x7u<<16)
#define	TIM1_DCR_DBL_B_0X0			(0x0u<<8)
#define	TIM1_DCR_DBL_B_0X1			(0x1u<<8)
#define	TIM1_DCR_DBL_B_0X2			(0x2u<<8)
#define	TIM1_DCR_DBL_B_0X1A			(0x1Au<<8)
#define	TIM1_DCR_DBA_B_0X0			(0x0u<<0)
#define	TIM1_DCR_DBA_B_0X1			(0x1u<<0)
#define	TIM1_DCR_DBA_B_0X2			(0x2u<<0)

// DMAR Configuration

#define	TIM1_DMAR_DMAB				(0xFFFFFFFFu<<0)
#define	TIM1_DMAR_DMAB_0			(0x1u<<0)
